sterentev/atdf-device-asm-include/inc/ATmega16U2.inc
; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - Force Output Compare 1A
.equ	FOC1B		= 6		; 0x40 - Force Output Compare 1B
.equ	FOC1C		= 5		; 0x20 - Force Output Compare 1C

; ----------	Register TCNT1 bits		------------------------
.equ	TCNT1_MASK	= 0xFFFF	;      - Timer/Counter1 bits (16 bits)
.equ	TCNT10		= 0		;          TCNT1 BIT0 position

; ----------	Register OCR1A bits		------------------------
.equ	OCR1A_MASK	= 0xFFFF	;      - Timer/Counter1 Output Compare A bits (16 bits)
.equ	OCR1A0		= 0		;          OCR1A BIT0 position

; ----------	Register OCR1B bits		------------------------
.equ	OCR1B_MASK	= 0xFFFF	;      - Timer/Counter1 Output Compare B bits (16 bits)
.equ	OCR1B0		= 0		;          OCR1B BIT0 position

; ----------	Register OCR1C bits		------------------------
.equ	OCR1C_MASK	= 0xFFFF	;      - Timer/Counter1 Output Compare C bits (16 bits)
.equ	OCR1C0		= 0		;          OCR1C BIT0 position

; ----------	Register ICR1 bits		------------------------
.equ	ICR1_MASK	= 0xFFFF	;      - Timer/Counter1 Input Capture bits (16 bits)
.equ	ICR10		= 0		;          ICR1 BIT0 position

; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 5		; 0x20 - Timer/Counter1 Input Capture Interrupt Enable
.equ	OCIE1C		= 3		; 0x08 - Timer/Counter1 Output Compare C Match Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 5		; 0x20 - Input Capture Flag 1
.equ	OCF1C		= 3		; 0x08 - Output Compare Flag 1C
.equ	OCF1B		= 2		; 0x04 - Output Compare Flag 1B
.equ	OCF1A		= 1		; 0x02 - Output Compare Flag 1A
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag



; ====	PLL MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PLLCSR bits		------------------------
.equ	PLLP_MASK	= 0x1C		;      - PLL prescaler Bits (3 bits)
.equ	PLLP0		= 2		;          PLLP BIT0 position
.equ	PLLE		= 1		; 0x02 - PLL Enable Bit
.equ	PLOCK		= 0		; 0x01 - PLL Lock Status Bit
; ::::  PLLP	:::: bitfield values
;			0x0C		; Clock/4
;			0x14		; Clock/8



; ====	USB_DEVICE MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register UPOE bits		------------------------
.equ	UPWE_MASK	= 0xC0		;      - USB Buffers Direct Drive enable configuration (2 bits)
.equ	UPWE0		= 6		;          UPWE BIT0 position
.equ	UPDRV_MASK	= 0x30		;      - USB direct drive values (2 bits)
.equ	UPDRV0		= 4		;          UPDRV BIT0 position
.equ	DPI		= 1		; 0x02 - D+ Input value
.equ	DMI		= 0		; 0x01 - D- Input value

; ----------	Register UEINT bits		------------------------
.equ	EPINT_MASK	= 0x1F		;      - Byte Count bits (5 bits)
.equ	EPINT0		= 0		;          EPINT BIT0 position

; ----------	Register UEBCLX bits		------------------------
.equ	BYCT_MASK	= 0xFF		;      - Byte Count bits (8 bits)
.equ	BYCT0		= 0		;          BYCT BIT0 position

; ----------	Register UEDATX bits		------------------------
.equ	DAT_MASK	= 0xFF		;      - Data bits (8 bits)
.equ	DAT0		= 0		;          DAT BIT0 position

; ----------	Register UEIENX bits		------------------------
.equ	FLERRE		= 7		; 0x80 - Flow Error Interrupt Enable Flag
.equ	NAKINE		= 6		; 0x40 - NAK IN Interrupt Enable Bit
.equ	NAKOUTE		= 4		; 0x10 - NAK OUT Interrupt Enable Bit
.equ	RXSTPE		= 3		; 0x08 - Received SETUP Interrupt Enable Flag
.equ	RXOUTE		= 2		; 0x04 - Received OUT Data Interrupt Enable Flag
.equ	STALLEDE	= 1		; 0x02 - Stalled Interrupt Enable Flag
.equ	TXINE		= 0		; 0x01 - Transmitter Ready Interrupt Enable Flag

; ----------	Register UESTA1X bits		------------------------
.equ	CTRLDIR		= 2		; 0x04 - Control Direction
.equ	CURRBK_MASK	= 0x03		;      - Current Bank (2 bits)
.equ	CURRBK0		= 0		;          CURRBK BIT0 position

; ----------	Register UESTA0X bits		------------------------
.equ	CFGOK		= 7		; 0x80 - Configuration Status Flag
.equ	OVERFI		= 6		; 0x40 - Overflow Error Interrupt Flag
.equ	UNDERFI		= 5		; 0x20 - Underflow Error Interrupt Flag
.equ	DTSEQ_MASK	= 0x0C		;      - Data Toggle Sequencing Flag (2 bits)
.equ	DTSEQ0		= 2		;          DTSEQ BIT0 position
.equ	NBUSYBK_MASK	= 0x03		;      - Busy Bank Flag (2 bits)
.equ	NBUSYBK0	= 0		;          NBUSYBK BIT0 position

; ----------	Register UECFG1X bits		------------------------
.equ	EPSIZE_MASK	= 0x70		;      - Endpoint Size Bits (3 bits)
.equ	EPSIZE0		= 4		;          EPSIZE BIT0 position
.equ	EPBK_MASK	= 0x0C		;      - Endpoint Bank Bits (2 bits)
.equ	EPBK0		= 2		;          EPBK BIT0 position
.equ	ALLOC		= 1		; 0x02 - Endpoint Allocation Bit

; ----------	Register UECFG0X bits		------------------------
.equ	EPTYPE_MASK	= 0xC0		;      - Endpoint Type Bits (2 bits)
.equ	EPTYPE0		= 6		;          EPTYPE BIT0 position
.equ	EPDIR		= 0		; 0x01 - Endpoint Direction Bit

; ----------	Register UECONX bits		------------------------
.equ	STALLRQ		= 5		; 0x20 - STALL Request Handshake Bit
.equ	STALLRQC	= 4		; 0x10 - STALL Request Clear Handshake Bit
.equ	RSTDT		= 3		; 0x08 - Reset Data Toggle Bit
.equ	EPEN		= 0		; 0x01 - Endpoint Enable Bit

; ----------	Register UERST bits		------------------------
.equ	EPRST_MASK	= 0x1F		;      - Endpoint FIFO Reset Bits (5 bits)
.equ	EPRST0		= 0		;          EPRST BIT0 position

; ----------	Register UENUM bits		------------------------
.equ	EPNUM_MASK	= 0x07		;      - Endpoint Number bits (3 bits)
.equ	EPNUM0		= 0		;          EPNUM BIT0 position

; ----------	Register UEINTX bits		------------------------
.equ	FIFOCON		= 7		; 0x80 - FIFO Control Bit
.equ	NAKINI		= 6		; 0x40 - NAK IN Received Interrupt Flag
.equ	RWAL		= 5		; 0x20 - Read/Write Allowed Flag
.equ	NAKOUTI		= 4		; 0x10 - NAK OUT Received Interrupt Flag
.equ	RXSTPI		= 3		; 0x08 - Received SETUP Interrupt Flag
.equ	RXOUTI		= 2		; 0x04 - Received OUT Data Interrupt Flag
.equ	STALLEDI	= 1		; 0x02 - STALLEDI Interrupt Flag
.equ	TXINI		= 0		; 0x01 - Transmitter Ready Interrupt Flag

; ----------	Register UDMFN bits		------------------------
.equ	FNCERR		= 4		; 0x10 - Frame Number CRC Error Flag

; ----------	Register UDFNUM bits		------------------------
.equ	FNUM_MASK	= 0x07FF	;      - Frame Number Upper Flag (11 bits)
.equ	FNUM0		= 0		;          FNUM BIT0 position

; ----------	Register UDADDR bits		------------------------
.equ	ADDEN		= 7		; 0x80 - Address Enable Bit
.equ	UADD_MASK	= 0x7F		;      - USB Address Bits (7 bits)
.equ	UADD0		= 0		;          UADD BIT0 position

