sterentev/atdf-device-asm-include/inc/ATmega16U2.inc
; ----------	Register UDIEN bits		------------------------
.equ	UPRSME		= 6		; 0x40 - Upstream Resume Interrupt Enable Bit
.equ	EORSME		= 5		; 0x20 - End Of Resume Interrupt Enable Bit
.equ	WAKEUPE		= 4		; 0x10 - Wake-up CPU Interrupt Enable Bit
.equ	EORSTE		= 3		; 0x08 - End Of Reset Interrupt Enable Bit
.equ	SOFE		= 2		; 0x04 - Start Of Frame Interrupt Enable Bit
.equ	SUSPE		= 0		; 0x01 - Suspend Interrupt Enable Bit

; ----------	Register UDINT bits		------------------------
.equ	UPRSMI		= 6		; 0x40 - Upstream Resume Interrupt Flag
.equ	EORSMI		= 5		; 0x20 - End Of Resume Interrupt Flag
.equ	WAKEUPI		= 4		; 0x10 - Wake-up CPU Interrupt Flag
.equ	EORSTI		= 3		; 0x08 - End Of Reset Interrupt Flag
.equ	SOFI		= 2		; 0x04 - Start Of Frame Interrupt Flag
.equ	SUSPI		= 0		; 0x01 - Suspend Interrupt Flag

; ----------	Register UDCON bits		------------------------
.equ	RSTCPU		= 2		; 0x04 - USB Reset CPU Bit
.equ	RMWKUP		= 1		; 0x02 - Remote Wake-up Bit
.equ	DETACH		= 0		; 0x01 - Detach Bit

; ----------	Register USBCON bits		------------------------
.equ	USBE		= 7		; 0x80 - USB macro Enable Bit
.equ	FRZCLK		= 5		; 0x20 - Freeze USB Clock Bit

; ----------	Register REGCR bits		------------------------
.equ	REGDIS		= 0		; 0x01 - Regulator Disable



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	USBRF		= 5		; 0x20 - USB reset flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - 
.equ	CLKPS_MASK	= 0x0F		;      -  (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; Reserved
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby

; ----------	Register GPIOR2 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 2 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 1 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose IO Register 0 bit 7
.equ	GPIOR06		= 6		; 0x40 - General Purpose IO Register 0 bit 6
.equ	GPIOR05		= 5		; 0x20 - General Purpose IO Register 0 bit 5
.equ	GPIOR04		= 4		; 0x10 - General Purpose IO Register 0 bit 4
.equ	GPIOR03		= 3		; 0x08 - General Purpose IO Register 0 bit 3
.equ	GPIOR02		= 2		; 0x04 - General Purpose IO Register 0 bit 2
.equ	GPIOR01		= 1		; 0x02 - General Purpose IO Register 0 bit 1
.equ	GPIOR00		= 0		; 0x01 - General Purpose IO Register 0 bit 0

; ----------	Register PRR1 bits		------------------------
.equ	PRUSB		= 7		; 0x80 - Power Reduction USB
.equ	PRUSART1	= 0		; 0x01 - Power Reduction USART1

; ----------	Register PRR0 bits		------------------------
.equ	PRTIM0		= 5		; 0x20 - Power Reduction Timer/Counter0
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface

; ----------	Register CLKSTA bits		------------------------
.equ	RCON		= 1		; 0x02 - 
.equ	EXTON		= 0		; 0x01 - 

; ----------	Register CLKSEL1 bits		------------------------
.equ	RCCKSEL_MASK	= 0xF0		;      -  (4 bits)
.equ	RCCKSEL0	= 4		;          RCCKSEL BIT0 position
.equ	EXCKSEL_MASK	= 0x0F		;      -  (4 bits)
.equ	EXCKSEL0	= 0		;          EXCKSEL BIT0 position

; ----------	Register CLKSEL0 bits		------------------------
.equ	RCSUT_MASK	= 0xC0		;      -  (2 bits)
.equ	RCSUT0		= 6		;          RCSUT BIT0 position
.equ	EXSUT_MASK	= 0x30		;      -  (2 bits)
.equ	EXSUT0		= 4		;          EXSUT BIT0 position
.equ	RCE		= 3		; 0x08 - 
.equ	EXTE		= 2		; 0x04 - 
.equ	CLKS		= 0		; 0x01 - 



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position

; ----------	Register EICRB bits		------------------------
.equ	ISC7_MASK	= 0xC0		;      - External Interrupt 7-4 Sense Control Bit (2 bits)
.equ	ISC70		= 6		;          ISC7 BIT0 position
.equ	ISC6_MASK	= 0x30		;      - External Interrupt 7-4 Sense Control Bit (2 bits)
.equ	ISC60		= 4		;          ISC6 BIT0 position
.equ	ISC5_MASK	= 0x0C		;      - External Interrupt 7-4 Sense Control Bit (2 bits)
.equ	ISC50		= 2		;          ISC5 BIT0 position
.equ	ISC4_MASK	= 0x03		;      - External Interrupt 7-4 Sense Control Bit (2 bits)
.equ	ISC40		= 0		;          ISC4 BIT0 position

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0xFF		;      - External Interrupt Request 7 Enable (8 bits)
.equ	INT0		= 0		;          INT BIT0 position

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0xFF		;      - External Interrupt Flags (8 bits)
.equ	INTF0		= 0		;          INTF BIT0 position

; ----------	Register PCMSK0 bits		------------------------
.equ	PCMSK0_PCINT_MASK= 0xFF		;      - Pin Change Enable Masks (8 bits)
.equ	PCMSK0_PCINT0	= 0		;          PCMSK0_PCINT BIT0 position

; ----------	Register PCMSK1 bits		------------------------
.equ	PCMSK1_PCINT_MASK= 0x1F		;      -  (5 bits)
.equ	PCMSK1_PCINT0	= 0		;          PCMSK1_PCINT BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIF_MASK	= 0x03		;      - Pin Change Interrupt Flags (2 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position

