sterentev/atdf-device-asm-include/inc/ATmega16U2.inc
; ----------	Register PCICR bits		------------------------
.equ	PCIE_MASK	= 0x03		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UDR1 bits		------------------------
.equ	UDR1_MASK	= 0xFF		;      - USART I/O Data bits (8 bits)
.equ	UDR10		= 0		;          UDR1 BIT0 position

; ----------	Register UCSR1A bits		------------------------
.equ	RXC1		= 7		; 0x80 - USART Receive Complete
.equ	TXC1		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE1		= 5		; 0x20 - USART Data Register Empty
.equ	FE1		= 4		; 0x10 - Framing Error
.equ	DOR1		= 3		; 0x08 - Data overRun
.equ	UPE1		= 2		; 0x04 - Parity Error
.equ	U2X1		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM1		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR1B bits		------------------------
.equ	RXCIE1		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE1		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE1		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN1		= 4		; 0x10 - Receiver Enable
.equ	TXEN1		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ12		= 2		; 0x04 - Character Size
.equ	RXB81		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB81		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR1C bits		------------------------
.equ	UMSEL1_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL10		= 6		;          UMSEL1 BIT0 position
.equ	UPM1_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM10		= 4		;          UPM1 BIT0 position
.equ	USBS1		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ1_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ10		= 1		;          UCSZ1 BIT0 position
.equ	UCPOL1		= 0		; 0x01 - Clock Polarity

; ----------	Register UCSR1D bits		------------------------
.equ	CTSEN		= 1		; 0x02 - CTS Enable
.equ	RTSEN		= 0		; 0x01 - RTS Enable

; ----------	Register UBRR1 bits		------------------------
.equ	UBRR1_MASK	= 0x0FFF	;      - USART Baud Rate bits (12 bits)
.equ	UBRR10		= 0		;          UBRR1 BIT0 position



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable

; ----------	Register WDTCKD bits		------------------------
.equ	WDEWIF		= 3		; 0x08 - Watchdog Early Warning Interrupt Flag
.equ	WDEWIE		= 2		; 0x04 - Watchdog Early Warning Interrupt Enable
.equ	WCLKD_MASK	= 0x03		;      - Watchdog Timer Clock Dividers (2 bits)
.equ	WCLKD0		= 0		;          WCLKD BIT0 position



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select bits (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge

; ----------	Register ACMUX bits		------------------------
.equ	CMUX_MASK	= 0x07		;      - Analog Comparator Selection Bits (3 bits)
.equ	CMUX0		= 0		;          CMUX BIT0 position
; ::::  CMUX	:::: bitfield values
;			0x00		; AIN1
;			0x01		; AIN2
;			0x02		; AIN3
;			0x03		; AIN4
;			0x04		; AIN5
;			0x05		; AIN6

; ----------	Register DIDR1 bits		------------------------
.equ	AIN7D		= 7		; 0x80 - AIN7 Digital Input Disable
.equ	AIN6D		= 6		; 0x40 - AIN6 Digital Input Disable
.equ	AIN5D		= 5		; 0x20 - AIN5 Digital Input Disable
.equ	AIN4D		= 4		; 0x10 - AIN4 Digital Input Disable
.equ	AIN3D		= 3		; 0x08 - AIN3 Digital Input Disable
.equ	AIN2D		= 2		; 0x04 - AIN2 Digital Input Disable
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 29
.equ	INT_VECTORS_SIZE	= 0x3A
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	INT3		; External Interrupt Request 3
;	5	INT4		; External Interrupt Request 4
;	6	INT5		; External Interrupt Request 5
;	7	INT6		; External Interrupt Request 6
;	8	INT7		; External Interrupt Request 7
;	9	PCINT0		; Pin Change Interrupt Request 0
;	10	PCINT1		; Pin Change Interrupt Request 1
;	11	USB_GEN		; USB General Interrupt Request
;	12	USB_COM		; USB Endpoint/Pipe Interrupt Communication Request
;	13	WDT		; Watchdog Time-out Interrupt
;	14	TIMER1_CAPT	; Timer/Counter2 Capture Event
;	15	TIMER1_COMPA	; Timer/Counter2 Compare Match B
;	16	TIMER1_COMPB	; Timer/Counter2 Compare Match B
;	17	TIMER1_COMPC	; Timer/Counter2 Compare Match C
;	18	TIMER1_OVF	; Timer/Counter1 Overflow
;	19	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	20	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	21	TIMER0_OVF	; Timer/Counter0 Overflow
;	22	SPI_STC		; SPI Serial Transfer Complete
;	23	USART1_RX	; USART1, Rx Complete
;	24	USART1_UDRE	; USART1 Data register Empty
;	25	USART1_TX	; USART1, Tx Complete
;	26	ANALOG_COMP	; Analog Comparator
;	27	EE_READY	; EEPROM Ready
;	28	SPM_READY	; Store Program Memory Read


